Configuration/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Управляет логикой формы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступленияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>На форме — гиперссылка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Comment>ОграничениеТипа меняется в коде по виду операции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>Отбор по Владельцу; скрывать по условию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Вводится вручную (нет ТЧ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Автозаполнение текущим пользователем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Enums/ВидыОперацийПоступленияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступленияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/ПриходныйКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
    ВидОп = Объект.ВидОперации;
    ВозвратПодотчётника = ПредопределенноеЗначение(
        "Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника");

        ДопТипы = Новый Массив;
    Если ВидОп = ВозвратПодотчётника Тогда
        ДопТипы.Добавить(Тип("СправочникСсылка.Сотрудники"));
    Иначе
        ДопТипы.Добавить(Тип("СправочникСсылка.Контрагенты"));
    КонецЕсли;
    Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов(ДопТипы);

    ПоказыватьДоговор = Истина;
    Если ВидОп = ВозвратПодотчётника Тогда
        ПоказыватьДоговор = Ложь;
    ИначеЕсли ЗначениеЗаполнено(Объект.Плательщик)
          И ТипЗнч(Объект.Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
        ТипКонтр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
            Объект.Плательщик, "ТипКонтрагента");
        Если ТипКонтр = Перечисления.ТипыКонтрагентов.Клиент Тогда
            ПоказыватьДоговор = Ложь;
        КонецЕсли;
    КонецЕсли;
    Элементы.Договор.Видимость = ПоказыватьДоговор;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВидОперацииПриИзменении(Элемент)
    НовыйВидОп     = Объект.ВидОперации;
    БылСотрудник   = (ТипЗнч(Объект.Плательщик) = Тип("СправочникСсылка.Сотрудники"));
    НуженСотрудник = (НовыйВидОп = ПредопределенноеЗначение(
        "Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника"));

    Если ЗначениеЗаполнено(Объект.Плательщик) И (БылСотрудник <> НуженСотрудник) Тогда
        Обещание = ВопросАсинх(
            "Вид операции изменён. Очистить поля Плательщик и Договор?",
            РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
        Ответ = Ждать Обещание;
        ВидОперацииОбновитьФорму(Ответ = КодВозвратаДиалога.Да);
    Иначе
        ВидОперацииОбновитьФорму(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииЗавершениеОчистки(Результат, ДопПараметры) Экспорт
    ВидОперацииОбновитьФорму(Результат = КодВозвратаДиалога.Да);
КонецПроцедуры

&НаСервере
Процедура ВидОперацииОбновитьФорму(ОчиститьПлательщика)
    Если ОчиститьПлательщика Тогда
        Объект.Плательщик = Неопределено;
        Объект.Договор    = Справочники.Договоры.ПустаяСсылка();
    КонецЕсли;
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
    ПлательщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПлательщикПриИзмененииНаСервере()
    Объект.Договор = Справочники.Договоры.ПустаяСсылка();
    УстановитьВидимость();
КонецПроцедуры
